// url: https://www.acmicpc.net/problem/17103
// 
// step: 8
// 
// id: 17103
// 
// title: 골드바흐 파티션
// 
// description:
// 골드바흐의 추측: 2보다 큰 짝수는 두 소수의 합으로 나타낼 수 있다.
// 
// 
// 짝수 N을 두 소수의 합으로 나타내는 표현을 골드바흐 파티션이라고 한다. 짝수 N이 주어졌을 때, 골드바흐 파티션의 개수를 구해보자. 두 소수의 순서만 다른 것은 같은 파티션이다.
// 
// input:
// 
// 					첫째 줄에 테스트 케이스의 개수 T (1 ≤ T ≤ 100)가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고, 정수 N은 짝수이고, 2 < N ≤ 1,000,000을 만족한다.
// 
// 					
// 
// output:
// 
// 					각각의 테스트 케이스마다 골드바흐 파티션의 수를 출력한다.
// 
// 					
// 
// sample input / output: 경로 내 txt 확인
// 
// 이미지 여부: false
// 
// 